export const categorykData = {
  categories: [
    {
      name: "취미 및 여가 활동",
      activities: [
        { id: 1, name: "책 읽기", emoji: "📚" },
        { id: 2, name: "영화/드라마 시청", emoji: "🎬" },
        { id: 3, name: "음악 감상", emoji: "🎵" },
        { id: 4, name: "그림 그리기", emoji: "🎨 (그림 그리기, 수채화 등)" },
        { id: 5, name: "공예", emoji: "🧶 (퀼트, 자수, 뜨개질 등)" },
        { id: 6, name: "요리", emoji: "👩‍🍳 (레시피 찾아보기, 요리 실험 등)" },
        { id: 7, name: "여행", emoji: "✈️ (해외, 국내, 당일치기 등)" },
        { id: 8, name: "쇼핑", emoji: "🛍️ (의류, 전자제품, 가구 등)" },
        {
          id: 9,
          name: "경기 및 공연 관람",
          emoji: "🎭 (스포츠 경기, 연극, 콘서트 등)",
        },
        {
          id: 10,
          name: "게임하기",
          emoji: "🎮 (컴퓨터 게임, 보드게임, 카드 게임 등)",
        },
        { id: 11, name: "반려동물", emoji: "🐾 (산책, 놀이 등)" },
        { id: 12, name: "청소 및 정리", emoji: "🧹" },
        { id: 13, name: "인테리어", emoji: "🏠" },
        { id: 14, name: "피크닉", emoji: "🧺" },
        { id: 15, name: "낚시", emoji: "🎣" },
        { id: 16, name: "사진 찍기 및 사진 편집", emoji: "📷" },
        { id: 17, name: "춤추기", emoji: "💃 (댄스, 필라테스, 줌바 등)" },
        { id: 18, name: "놀이공원", emoji: "🎡" },
        { id: 19, name: "일하기", emoji: "💼" },
      ],
    },
    {
      name: "건강",
      activities: [
        {
          id: 20,
          name: "식사",
          emoji: "🍽️ (건강한 식단 조리, 식사 규칙적으로 하기 등)",
        },
        {
          id: 21,
          name: "수면",
          emoji: "😴 (수면 패턴 유지, 편안한 수면 환경 조성 등)",
        },
        {
          id: 22,
          name: "건강 관리",
          emoji: "🏥 (정기적인 건강검진, 병원 방문 등)",
        },
        {
          id: 23,
          name: "정신 건강 관리",
          emoji: "🧘‍♀️ (스트레스 관리, 정신적 치유 등)",
        },
      ],
    },
    {
      name: "음식",
      activities: [
        {
          id: 24,
          name: "요리하기",
          emoji: "🍳 (아침식사, 점심식사, 저녁식사 등)",
        },
        { id: 25, name: "외식", emoji: "🍽️ (카페, 식당, 음식점 등)" },
        { id: 26, name: "외식", emoji: "🍽️ (카페, 식당, 음식점 등)" },
      ],
    },
    {
      name: "운동",
      activities: [
        { id: 27, name: "헬스", emoji: "🏋️ (운동기구 이용한 운동)" },
        { id: 28, name: "유산소 운동", emoji: "🏃‍♀️ (달리기)" },
        { id: 29, name: "근력 운동", emoji: "💪" },
        { id: 30, name: "구기 운동", emoji: "⚽️ (축구, 농구, 테니스 등)" },
        { id: 31, name: "라켓 스포츠", emoji: "🎾 (탁구, 테니스)" },
        { id: 32, name: "야외 활동", emoji: "⛰️🚶‍♀️ (등산)" },
        { id: 33, name: "요가 및 필라테스", emoji: "🧘" },
        { id: 34, name: "탈 것", emoji: "🚴‍♀️" },
        { id: 35, name: "수상 스포츠", emoji: "🏊‍♀️ (서핑, 수영, 다이빙 등)" },
        { id: 36, name: "빙상 스포츠", emoji: "🛼" },
        { id: 37, name: "격기", emoji: "🥋" },
      ],
    },
    {
      name: "소셜 활동",
      activities: [
        { id: 38, name: "친구와의 만남", emoji: "👯‍♀️ (외식, 카페, 쇼핑 등)" },
        { id: 39, name: "가족과의 시간", emoji: "👨‍👩‍👧‍👦 (가족모임, 가족여행 등)" },
        { id: 40, name: "동호회 활동", emoji: "🤼‍♂️ (운동 동호회, 책 클럽 등)" },
        {
          id: 41,
          name: "파티/이벤트 참여",
          emoji: "🎉 (생일파티, 결혼식, 축제 등)",
        },
        { id: 42, name: "SNS", emoji: "📱 (인스타그램, 페이스북, 트위터 등)" },
        { id: 43, name: "육아", emoji: "🍼 (자녀와의 시간, 육아일지 작성 등)" },
        { id: 44, name: "연애", emoji: "👩‍❤️‍👨 (데이트, 애정 표현 등)" },
      ],
    },
    {
      name: "자기계발",
      activities: [
        {
          id: 45,
          name: "공부하기",
          emoji: "📚 (온라인 강의 수강, 새로운 기술 학습 등)",
        },
        {
          id: 46,
          name: "독서",
          emoji: "📖 (자기계발 서적, 소설, 전문 서적 등)",
        },
        {
          id: 47,
          name: "명상 및 정신 수련",
          emoji: "🧘 (명상 앱 이용, 정신적 안정을 위한 시간 확보 등)",
        },
        {
          id: 48,
          name: "일기 쓰기",
          emoji: "✍️ (하루 일정 기록, 감정 기록 등)",
        },
        { id: 49, name: "목표 설정 및 계획 세우기", emoji: "🗺️" },
      ],
    },
    {
      name: "자연 및 환경",
      activities: [
        { id: 50, name: "자연 속 산책", emoji: "🌲🚶‍♀️ (공원, 산, 숲 등)" },
        {
          id: 51,
          name: "정원 가꾸기",
          emoji: "🏡 (화분 가꾸기, 화단 가꾸기 등)",
        },
        {
          id: 52,
          name: "환경 보호 활동 참여",
          emoji: "🌎 (비닐 줄이기, 재활용 활동 참여 등)",
        },
      ],
    },
    {
      name: "창작활동",
      activities: [
        {
          id: 53,
          name: "글쓰기",
          emoji: "✍️ (일기 쓰기, 소설 쓰기, 시 쓰기 등)",
        },
        {
          id: 54,
          name: "그림 그리기",
          emoji: "🎨 (수채화, 연필화, 아크릴화 등)",
        },
        { id: 55, name: "음악 작곡", emoji: "🎶 (악기 연주, 노래 작성 등)" },
        {
          id: 56,
          name: "사진 찍기",
          emoji: "📸 (풍경 사진, 인물 사진, 테마별 사진 등)",
        },
      ],
    },
    {
      name: "종교 및 정신적 활동",
      activities: [
        { id: 57, name: "기도하기", emoji: "🙏 (교회, 사찰 방문 등)" },
        { id: 58, name: "명상", emoji: "🧘‍♀️ (요가, 명상, 테라피 등)" },
        { id: 59, name: "명상", emoji: "🧘‍♀️ (요가, 명상, 테라피 등)" },
      ],
    },
  ],
};
